Autodesk.Revit.DB.StringUtil.CharFilter
CharFilter is a Enum type for StringValidator
Since:
2027
Identify different sets of characters which will be deemed illegal in different contexts
Since:
2027

Autodesk.Revit.DB.StringUtil.CharFilter.Custom
custom filtering

Autodesk.Revit.DB.StringUtil.CharFilter.Path
printable, suitable for full path name

Autodesk.Revit.DB.StringUtil.CharFilter.Name
printable, suitable for leaf name of a file

Autodesk.Revit.DB.StringUtil.CharFilter.Printable
any printable characters